class RealType(object):
    SENDTYPE = {
        "거래구분":{
            '지정가':'00',
            '시장가':'03',
            '조건부지정가': '05',
            '최유리지정가': '06',
            '최우선지정가': '07',
            '지정가IOC': '10',
            '시장가IOC': '13',
            '최유리IOC': '16',
            '지정가FOK': '20',
            '시장가FOK': '23',
            '최유리FOK': '26',
            '장전시간외종가': '61',
            '시간외단일가매매': '62',
            '장후시간외종가': '81'
        }
    }

    REALTYPE = {
        '주식체결':{
            '체결시간' : 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20,
            '체결시간': 20


        }
    }